<template>
    <b-container class="pt-5 pb-5" id="th-faq">
        <p class="text-center th-block-title">Часто задаваемые вопросы</p>
        <ul class="list-unstyled row th-ask-list" v-bind:class="{'is-collapsed' : collapsed }">
            <li v-for="answer in questionList" :key="answer.id" class="col-sm-6 mb-5 th-ask-item">
                <p class="th-ask-title">{{answer.title}}</p>
                <p class="th-ask-text">{{answer.text}}</p>
            </li>
        </ul>
        <span @click="toggleButton()" class="th-view-more" :class="[this.collapsed ? 'th-close' : 'th-open']">{{collapsedText}}<i class="fa fa-angle-down" aria-hidden="true"></i></span>
    </b-container>
</template>

<script>
/* eslint-disable indent */
  import constants from '@/constants'

  export default {
    name: 'FAQ',
    methods: {
      toggleButton () {
        this.collapsed = !this.collapsed
        if (this.collapsed) {
          this.collapsedText = constants.showTextMore
          this.$scrollTo(this.blockId, 400, constants.options)
        } else {
          this.collapsedText = constants.showTextLess
        }
      }
    },
    data () {
      return {
        blockId: '#th-faq',
        collapsedText: constants.showTextMore,
        collapsed: true,
        questionList: [
          {
            title: 'Вы отправите исходный код?',
            text: 'Нет, мы продаем эти приложения как продукты и не разделяем исходный код. Но мы заботимся о поддержке и обслуживании продукта. У нас есть полное авторское право на код.'
          },
          {
            title: 'Что вы делаете в поддержке и обслуживании?',
            text: 'Все обновления ОС. Обновление функции в рамках плана. Поддержка электронной почты и звонков по любой проблеме или простым запросам. Исправление ошибок.'
          },
          {
            title: 'Почему вы оплачиваете на шесть месяцев вперед?',
            text: 'Для первичной настройки требуется значительная часть работы. За нее мы платим разработчикам. Также мы предпочитаем работать с серьезными покупателями. Если кто-то зарегистрируется на месяц, а затем откажется, мы не сможем сосредоточиться на текущих клиентах. Но! У вас есть возможность попробовать приложение перед покупкой. Выбирайте бесплатную пробную версию для своего магазина, а также смотрите демо приложения для просмотра UI / UX и функций'
          },
          {
            title: 'Если я отменил план через один месяц, вы вернете пятимесячный взнос?',
            text: 'Первоначальный платеж за 6 месяцев не возвращается, но ежемесячный план может быть отменён в любое время.'
          },
          {
            title: 'Могу ли я перейти на одноразовый платеж?',
            text: 'Да, вы можете перейти на одноразовый платеж в любое время, даже после того, как вы заплатите за шесть месяцев. План можно переключать только после полного цикла выставления счетов. Мы скорректируем любой авансовый платеж (на будущие месяцы) в единовременном плане платежей. Обратите внимание, что одноразовый платеж начнется с даты оплаты. Сумма, уплаченная за последние месяцы, не корректируется. Мы скорректируем только аванс, внесенный за будущие месяцы.'
          },
          {
            title: 'Как насчет Apple App Store / Google Play Store?',
            text: 'Мы загрузим ваше приложение на наших учетных записях, но вы можете купить свою собственную учетную запись, и мы поможем загрузить приложение там. Обратите внимание, что иногда Google и Apple не одобряют стороннее приложение. В этом случае вам нужно будет купить эти учетные записи. Google взимает единовременный взнос в размере 25 долларов США, а Apple взимает годовую плату в размере 99 долларов США.'
          },
          {
            title: 'Что, если я отменил план в середине месяца?',
            text: 'После оплаты за месяц возврат средств невозможен, но план будет активен для полного цикла выставления счетов (месяц). Он будет автоматически отключен со следующего платежного цикла.'
          },
          {
            title: 'Каковы способы оплаты?',
            text: 'Мы принимаем оплату по счету в украинских гривнах. Пожалуйста, свяжитесь с нами, если вы хотите оплатить другим способом.'
          },
          {
            title: 'Какой уровень настройки вы можете сделать?',
            text: 'Мы можем делать любые настройки, но не добавлять новые функции. Если в будущем список фукнций расширится, они автоматически обновятся в вашем приложении.'
          },
          {
            title: 'Я согласен. Каковы следующие шаги?',
            text: 'Давайте обсудим ваши требования к пользовательскому интерфейсу и функциям. Для лучшего понимания посмотрите демонстрационные приложения магазина. Пожалуйста, позвоните нам или свяжитесь с нами по имейлу...'
          }
        ]
      }
    }
  }
</script>

<style lang="scss" scoped>
    .is-collapsed {
        li:nth-child(n+5) {
            display: none;
        }
    }
    .th-ask-list {
        margin-top: 78px;
    }
    .th-ask-item {

    }
    .th-ask-title {
        font-size: 1.5rem;
        font-weight: 600;
        line-height: 1;
        min-height: 48px;
        margin-bottom: 38px;
    }

    .th-ask-text {
        font-size: 1.125rem;
        line-height: 1.5rem;
        font-weight: 400;
    }
    @media only screen and (max-width : 575px) {
        .th-ask-item {
            padding: 0;
        }
    }
</style>
