<template>
    <b-container class="pt-5 pb-5" id="application">
        <p class="th-block-title text-center">Некоторые факты</p>
        <ul class="list-unstyled row th-fact-list" v-bind:class="{'is-collapsed' : collapsed }">
            <li v-for="fact in factList" :key="fact.id" class="col-12 col-md-6 th-fact-item mb-4">
                <p class="th-fact-text">{{fact.text}}</p>
            </li>
        </ul>
        <span v-on:click=" collapsed = !collapsed" class="th-view-more">Посмотреть все<i class="fa fa-angle-down" aria-hidden="true"></i></span>
    </b-container>
</template>

<script>
  export default {
    name: 'SomeFacts',
    data () {
      return {
        collapsed: true,
        factList: [
          {
            text: 'Покупатели, использующие мобильные приложения, \n' +
            'просмотрели на 286 процентов больше продуктов, \n' +
            'чем мобильные веб-покупатели'
          },
          {
            text: 'Процент добавления товаров в корзину на \n' +
            '90% выше, чем у мобильных браузеров.'
          },
          {
            text: 'Приложения  - это удобный пользовательский интерфейс: просматривать и добавлять продукты в корзину легко и быстро, незивисимо от месторасположения.'
          },
          {
            text: 'С мобильными устройствами, способствующими более чем 50 процентам трафика электронной торговли, приложения для мобильной коммерции являются новым и наиболее востребованным клиентом.'
          },
          {
            text: 'Push Notifications - лучший способ связаться с клиентами. Имейлы больше не хороши, ведь большинство из них попадает в папку «Спам». Через мобильное приложение вы можете отправлять  целенаправленные push-уведомления для уменьшения отказа от товаров в корзине и дальнейшего привлечения клиентов. Расскажите о новых поступлениях, распродажах и многом другом в мгновенном push-сообщении.'
          },
          {
            text: 'Простота использования в родных (native) приложениях намного выше, чем в мобильном сайте. Более того, некоторые из функций возможны только в собственных (native) приложениях: добавление продуктов в список пожеланий, общение в чат-мессенджерах и т. д.'
          },
          {
            text: 'Постоянный клиент всегда ищет мобильное приложение, чтобы не пропустить существенное обновление в вашем магазине. Другая сторона медали - после установки приложения пользователь стремится стать постоянным клиентом.'
          },
          {
            text: 'Мобильные приложения просты в использовании. Одно касание - и полный каталог открыт, вам не нужно каждый раз вводить логин или выходить из системы.'
          },
          {
            text: 'Ничто не ставит ваш бренд и продукты в центре внимания так, как мобильное приложение. Клиент видит его каждый раз, когда использует свой телефон.'
          },
          {
            text: 'Каждый владелец бизнеса хочет понять своих клиентов, чтобы увеличить продажи. Большой плюс мобильного приложения - это аналитика, которая поставляется вместе с ним. Используйте аналитику, чтобы определить свою стратегию, создать более привлекательный контент и охватить больше пользователей.'
          },
          {
            text: 'Поднимите свой бренд на новые высоты, запустив мобильное приложение для своего магазина электронной коммерции. Это хороший дифференциатор, он показывает, что вы серьезно относитесь к своему бизнесу и опыту работы с клиентами.'
          },
          {
            text: 'Хотите, чтобы клиенты делали рекламу для вас, делясь своими товарами на WhatsApp, Facebook, Twitter, Instagram и других сайтах социальных сетей? Мобильное приложение имеет встроенные возможности совместного использования. Это сделает ваш магазин вирусом!'
          },
          {
            text: 'Пользователи могут использовать многие функции мобильного приложения. Например, напрямую позвонить вам или отправить электронное письмо.'
          },
          {
            text: 'Мобильные приложения увеличивают взаимодействие между вами и вашим клиентом.'
          },
          {
            text: 'Мобильные приложения приближают клиента к вам. Вы можете уведомить клиентов об обновлениях по их заказу, новых рекламных предложениях и других событиях в магазине, которые им интересны.'
          },
          {
            text: 'Мир движется от экранов компьютеров к мобильным устройствам. Наличия веб-сайта недостаточно, так как он не может быть полностью оптимизирован для мобильных событий. Мобильные приложения обеспечивают большую заинтересованность пользователей, поскольку они постоянно установлены на мобильных телефонах.'
          }
        ]
      }
    }
  }
</script>

<style lang="scss" scoped>
    .is-collapsed {
        li:nth-child(n+3) {
            display: none;
        }
    }
    .th-fact-text {
        font-weight: 300;
        font-size: 1.25rem;
    }
    @media only screen and (max-width : 575px) {
        .th-fact-item {
            padding: 0;
        }
    }
</style>
